In [49]:
%pylab inline
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import sklearn.feature_extraction as skfeatextract

Populating the interactive namespace from numpy and matplotlib

WARNING: pylab import has clobbered these variables: ['e']
`%matplotlib` prevents importing * from pylab and numpy

## Index
* [fillna in Age attribute](#fillna_age)
* [transform Sex into numeric type](#transform_sex)
* [encode Embarked attribute](#encode_embark)

In [16]:
titanic = pd.read_csv("train.csv")
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

<a id="fillna_age"></a>
### fillna in Age attribute
notice that in "Age" column, there are only 714 items, fewer than other attributes (which is 891). it indicates that there are a lot missing values in "Age"

In [17]:
print "there are %d NaN in Age attribute"%(np.count_nonzero( np.isnan(titanic.Age) ))

there are 177 NaN in Age attribute

In [18]:
print "mean of Age is: %3.2f"%(titanic.Age.mean())
print "median of Age is: %3.2f"%(titanic.Age.median())

mean of Age is: 29.70
median of Age is: 28.00

In [20]:
# decide to use median to fill the missing values
titanic.Age = titanic.Age.fillna(titanic.Age.median())
titanic.Age.describe()

count    891.000000
mean      29.361582
std       13.019697
min        0.420000
25%       22.000000
50%       28.000000
75%       35.000000
max       80.000000
Name: Age, dtype: float64

<a id="transform_sex"></a>
### transform Sex attributes to numeric type

In [33]:
sexgrps = titanic.Sex.groupby(titanic.Sex).size()
sexgrps / (sexgrps.sum())

Sex
female    0.352413
male      0.647587
dtype: float64

In [34]:
titanic.IsMale = (titanic.Sex == "male").astype(int)
titanic.IsMale.mean()

0.6475869809203143

<a id="encode_embark"></a>
### Encode the Embarked attribute

In [35]:
titanic.Embarked.unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [38]:
embark_counts = titanic.Embarked.groupby(titanic.Embarked).size()
embark_counts

Embarked
C    168
Q     77
S    644
dtype: int64

In [41]:
print "maximum embark position is '%s' with count=%d"%(embark_counts.argmax(),embark_counts.max())

maximum embark position is S with count=644

In [43]:
titanic.Embarked = titanic.Embarked.fillna(embark_counts.argmax())
titanic.Embarked.groupby(titanic.Embarked).size()

Embarked
C    168
Q     77
S    646
dtype: int64

In [59]:
temp = [ {"embarked":e} for e in titanic.Embarked]
embarkEncoder = skfeatextract.DictVectorizer()
embarkEncoded = embarkEncoder.fit_transform(temp).toarray()
embarkEncoded = pd.DataFrame(embarkEncoded,columns=embarkEncoder.get_feature_names())

In [61]:
embarkEncoded.head()

   embarked=C  embarked=Q  embarked=S
0           0           0           1
1           1           0           0
2           0           0           1
3           0           0           1
4           0           0           1

In [62]:
titanic.Embarked.head()

0    S
1    C
2    S
3    S
4    S
Name: Embarked, dtype: object